//const $ = document


let allWeblogInformation = [
    {id: 1 , title: ' پیراهن جین ', image: '../images/weblog/blog1.png' , description: 'پیراهن جین مردانه از آن دسته پیراهن هایی است که می تواند یک استایل کژوال و جوان پسندی برای شما بسازد. این پیراهن های مردانه ها جز علاقه مندی بسیار از مردان از جمله سلبریتی و افراد مشهور است. مثلا دیوید بکهام فوتبالیست مشهور یکی از کسانی است که علاقه ی زیادی به پیراهن مردانه جین دارد همانطور که مشاهده می کنید یک ست پیشنهادی استفاده از یک تی شرت ساده سفید ، شلوار جین تیره ، و پیراهن جین مردانه است که می توانید دکمه های آن را کاملا باز یا نیمه باز بگذاری'+
   ' شلوار جین مشکی را با در قدم اول می‌توانید با لباس‌های کلاسیکی که معرفی می‌کنیم ست کنید: تی‌شرت سفید، پیراهن سفید، سویشرت خاکستری یا طوسی، ژاکت‌های روشن، پیراهن جین آبی رنگ. این موارد را به یاد داشته باشید و برای یک استایل کلاسیک و شیک به کار ببرید.'+
   '2. اگر فردی پیراهن‌پوش هستید، باید گفت که با شلوار مشکی می‌توانی پیراهن‌هایی با رنگ روشن تکرنگ و یا رنگی و گلدار را ست کنید.'+
   '3. شلوار جین مشکی را می‌توانید با یک پیراهن همرنگ خودش و یا پیراهنی تیره رنگ هم ست کنید، اما باید توج داشته باشید که تیپتان کاملا مشکی نشود. با اضافه کردن یک کت رنگی، اکسسوری رنگی و یا کفش رنگی استایلتان را از سیاه یکدست دربیاورید.'+
  ' 4. معمولا خیلی از مردان عادت به پوشیدن پیراهن سفید رنگ با شلوار مشکی دارند که اتفاقا خیلی هم مناسب است، اما کسانی که در کنار این ترکیب، انواع کت و اور کت رنگی و بوت مردانه و انواع کفش‌های لوفر  را ست می‌کنند، همیشه خوشتیپ‌تر به نظر می‌آیند، مخصوصا اگر شلوار جین راسته یا پاچه تنگ را انتخاب کنند.' , date: ' 17 آبان 1401'},


    {id: 2 , title: ' برند تجاری مد ', image: '../images/weblog/blog2.png' , description: '  امروزه یکی از جنبه های مهم کسب وکار در سطح داخلی و بین المللی, تعیین برند تجاری است. در این رابطه بکارگیری یک استراتژی موثر در خصوص برندهای تجاری در صنایع مختلف از جمله صنعت لباس,'+
    ' بحثی مهم است که به شرکت ها امکان اتصال به بازار رقابتی را می دهد, بنابراین می توان برندسازی را نوعی نوآوری تلقی کرد. تعیین یک برند تجاری با ثبات و بر پایه یک خط مشی صحیح, ب ه'+
     ' ایجاد ارزش برند تجاری منجر می شود. پژوهش حاضر, با هدف شناسایی عوامل موثر بر مصرف برندهای خارجی در صنعت مد لباس در اصفهان, انجام شده است. این پژوهش, از لحاظ رو'+
      ', توصیفی-پیمایشی و از لحاظ هدف ماهیتی کاربردی است و به صورت آمیخته در دو سطح کیفی و کمی با استفاده از ابزارهای مصاحبه و پرسشنامه انجام شده است. نتایج حاصل از پژوهش حاض'+
       'در بخش کیفی نشان می دهد که 57 عامل موثر در مصرف برندهای خارجی وجود دارد که کیفیت, تنوع, به روز بودن لباس ها و... از جمله این عوامل هستند که در 9 بعد کلی:'+
       ' عوامل درونی, سازمانی, فردی, اجتماعی, اقتصادی, جمعیت شناختی, فرهنگی و سیاسی تقسیم شده اند. در بخش کمی, نتایج یافته ها نشان داد که از منظر متخصصان, عوامل فرهنگی و در دیدگاه مصرف کنندگان, عوامل درونی, از مجموع عوامل موثر, امتیاز بیشتری کسب کرده اند.' , date: ' 13 مهر 1401'},


    {id: 3 , title: 'محصولات جدید این فصل', image: '../images/weblog/blog3.png' , description: 'فصل پاییز به عنوان بهترین فصل برای رنگ ها است و همیشه پر از ایده های جذاب و بی پایان لباس برای افراد خوش استایل و شیک پوش است، فصلی که مناسب پوشیدن لباس ها و پارچه های رنگارنگ و جذاب است.'+
   'همچنین افرادی که گرمایی هستند بی صبرانه در انتظار فرا رسیدن فصل پاییز هستند، رنگ های قرمز و زرد در فصل پاییز برای لباس ها مانند کت، چکمه، جوراب، پلیور و… جلوه دو برابری دارد.'+
   'حقیقتا با نزدیک شدن به این فصل زیبا بهتر است لباس های خنک و نازک فصل تابستان جای خود را به لباس های پاییزی بدهند و به اصطلاح کمد تکانی کنید.'+
   'در ادامه به آیتم هایی خواهیم پرداخت که در این فصل باید به کمد لباس هایتان اضافه کنی'+
   'پوشیدن لباس های پاییزی مانند ژاکت سایز بزرگ و سویشرت از جمله لباس های پرطرفدار در فصل پاییز هستند، یکی از آیتم های مهم در استایل پاییزی سویشرت های باکیفیت هستند و فرقی هم نمی کند که یک سویشرت با مدل یقه اسکی یا یک ژاکت بافت را انتخاب کنید.' , date: ' 8 مهر 1401'},

]

const weblogImage = document.querySelector('.weblog-content__image')
const weblogTitle = document.querySelector('.weblog-content__title')
const weblogDescription = document.querySelector('.weblog-content__description')
const weblogDate = document.querySelector('.content__date')
const dateWeblog = document.querySelector('#date')



let serchParams = new URLSearchParams(location.search)
let getParamsId = serchParams.get('id')

let mainWeblog = allWeblogInformation.find( function (weblog){
   return weblog.id === Number(getParamsId)
})

if(mainWeblog){
   weblogImage.setAttribute('src' , mainWeblog.image)
   weblogTitle.innerHTML = mainWeblog.title
   weblogDescription.innerHTML = mainWeblog.description
   weblogDate.innerHTML = mainWeblog.date
   weblogDate.insertAdjacentHTML('afterbegin' , '<i  class="fa fa-calendar-days "></i>')

}



console.log(mainWeblog);